examples/cylinder2D_multiprocessing/env02/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
16200
(
-0.044734309
-0.04419834
-0.056992062
-0.051548618
-0.034320416
-0.059475297
-0.060085595
-0.047525649
...
)
;

boundaryField
{
    INLET
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            fixedValue;
        value           uniform 0;
    }
    TOP
    {
        type            zeroGradient;
    }
    BOTTOM
    {
        type            zeroGradient;
    }
    CYLINDER
    {
        type            zeroGradient;
    }
    JET1
    {
        type            zeroGradient;
    }
    JET2
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
